PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_dac.c
/*!
    \file    gd32f3x0_hal_dac.c
    \brief   DAC driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifdef GD32F350
#include "gd32f3x0_hal.h"

/* DAC DMA full transmission complete callback */
static void _dac_dma_full_transfer_complete(void *dma);
/* DAC DMA half transmission complete callback */
static void _dac_dma_half_transfer_complete(void *dma);
/* DAC DMA error callback */
static void _dac_dma_error(void *dma);


/*!
    \brief      initialize DAC
    \param[in]  dac_dev: DAC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  dac: the pointer of DAC init structure
                  output_waveform_selection:
                  only one parameter can be selected which is shown as below:
      \arg          DAC_WAVE_DISABLE: wave disable
      \arg          DAC_WAVE_MODE_LFSR: LFSR noise mode
      \arg          DAC_WAVE_MODE_TRIANGLE: triangle noise mode
                  noise_wave_bit_width:
                  only one parameter can be selected which is shown as below:
      \arg          DAC_WAVE_BIT_WIDTH_1: bit width of the wave signal is 1
      \arg          DAC_WAVE_BIT_WIDTH_2: bit width of the wave signal is 2
      \arg          DAC_WAVE_BIT_WIDTH_3: bit width of the wave signal is 3
      \arg          DAC_WAVE_BIT_WIDTH_4: bit width of the wave signal is 4
      \arg          DAC_WAVE_BIT_WIDTH_5: bit width of the wave signal is 5
      \arg          DAC_WAVE_BIT_WIDTH_6: bit width of the wave signal is 6
      \arg          DAC_WAVE_BIT_WIDTH_7: bit width of the wave signal is 7
      \arg          DAC_WAVE_BIT_WIDTH_8: bit width of the wave signal is 8
      \arg          DAC_WAVE_BIT_WIDTH_9: bit width of the wave signal is 9
      \arg          DAC_WAVE_BIT_WIDTH_10: bit width of the wave signal is 10
      \arg          DAC_WAVE_BIT_WIDTH_11: bit width of the wave signal is 11
      \arg          DAC_WAVE_BIT_WIDTH_12: bit width of the wave signal is 12
                trigger_enable:
                only one parameter can be selected which is shown as below:
      \arg          ENABLE: enable trigger mode
      \arg          DISABLE: disable trigger mode
                trigger_selection:
                only one parameter can be selected which is shown as below:
      \arg          DAC_TRIGGER_T5_TRGO: TIMER5 TRGO
      \arg          DAC_TRIGGER_T2_TRGO: TIMER2 TRGO
      \arg          DAC_TRIGGER_T14_TRGO: TIMER14 TRGO
      \arg          DAC_TRIGGER_T1_TRGO: TIMER1 TRGO
      \arg          DAC_TRIGGER_EXTI_9: EXTI interrupt line9 event
      \arg          DAC_TRIGGER_SOFTWARE: software trigger
                aligned_mode:
                only one parameter can be selected which is shown as below:
      \arg          DAC_R12_ALIGNED_MODE: 12-bit right-aligned
      \arg          DAC_L12_ALIGNED_MODE: 12-bit left-aligned
      \arg          DAC_R8_ALIGNED_MODE: 8-bit right-aligned
                output_value: output_value to be loaded
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dac_init(hal_dac_dev_struct *dac_dev, hal_dac_init_struct *dac)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == dac_dev) || (NULL == dac)) {
        HAL_DEBUGE("pointer [*dac_dev] or pointer [*dac] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    dac_dev->state = DAC_STATE_BUSY;

    /* configure DAC wave mode */
    hals_dac_wave_mode_config(dac->output_waveform_selection);
    /* configure DAC wave bit width */
    hals_dac_wave_bit_width_config(dac->noise_wave_bit_width);
    /* enable or disable DAC output buffer */
    hals_dac_output_buffer_config(dac->output_buffer_enable);
    /* enable or disable DAC trigger */
    hals_dac_trigger_config(dac->trigger_enable);
    /* configure DAC trigger source */
    hals_dac_trigger_source_config(dac->trigger_selection);
    /* set DAC data holding register value */
    hals_dac_output_value_set(dac->aligned_mode, dac->output_value);
    /* change DAC error state */
    dac_dev->error_state = DAC_ERROR_NONE;
    /* change DAC state */
    dac_dev->state = DAC_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      deinitialize DAC device structure and init structure
    \param[in]  dac_dev: DAC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dac_deinit(hal_dac_dev_struct *dac_dev)
{

