PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_dac.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == dac_dev) {
        HAL_DEBUGE("pointer [dac_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    dac_dev->state = DAC_STATE_BUSY;
    /* deinit DAC */
    hal_rcu_periph_reset_enable(RCU_DACRST);
    hal_rcu_periph_reset_enable(RCU_DACRST);

    /* change DAC error state and state */
    dac_dev->error_state = DAC_ERROR_NONE;
    dac_dev->state = DAC_STATE_RESET;
    /* change DAC state */
    dac_dev->state = DAC_STATE_READY;
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      initialize the DAC structure with the default values
    \param[in]  hal_struct_type: the argument could be selected from enumeration <hal_dac_struct_type_enum>
    \param[in]  p_struct: pointer to DAC structure that contains the configuration information
    \param[out] none
    \retval     none
*/
void hal_dac_struct_init(hal_dac_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct) {
        HAL_DEBUGE("pointer [*p_struct] value is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    switch(hal_struct_type) {
    case HAL_DAC_INIT_STRUCT:
        /* initialize DAC initialization structure with the default values */
        ((hal_dac_init_struct *)p_struct)->output_waveform_selection                        = DAC_WAVE_DISABLE;
        ((hal_dac_init_struct *)p_struct)->noise_wave_bit_width                             = DAC_WAVE_BIT_WIDTH_1;
        ((hal_dac_init_struct *)p_struct)->trigger_enable                                   = DISABLE;
        ((hal_dac_init_struct *)p_struct)->output_buffer_enable                             = DISABLE;
        ((hal_dac_init_struct *)p_struct)->trigger_selection                                = DAC_TRIGGER_T5_TRGO;
        ((hal_dac_init_struct *)p_struct)->aligned_mode                                     = DAC_R12_ALIGNED_MODE;
        ((hal_dac_init_struct *)p_struct)->output_value                                     = 0U;
        break;
    case HAL_DAC_IRQ_STRUCT:
        /* initialize DAC initialization structure with the default values */
        ((hal_dac_irq_struct *)p_struct)->dac_underflow_handle                              = NULL;
        break;
    case HAL_DAC_DMA_HANDLE_CB_STRUCT:
        /* initialize DAC initialization structure with the default values */
        ((hal_dac_dma_handle_cb_struct *)p_struct)->full_transcom_handle                    = NULL;
        ((hal_dac_dma_handle_cb_struct *)p_struct)->half_transcom_handle                    = NULL;
        ((hal_dac_dma_handle_cb_struct *)p_struct)->error_handle                            = NULL;
        break;
    case HAL_DAC_DEV_STRUCT:
        /* initialize DAC initialization structure with the default values */
        ((hal_dac_dev_struct *)p_struct)->dac_irq.dac_underflow_handle                      = NULL;
        ((hal_dac_dev_struct *)p_struct)->p_dma_dac                                         = NULL;
        ((hal_dac_dev_struct *)p_struct)->dac_dma.full_transcom_handle                      = NULL;
        ((hal_dac_dev_struct *)p_struct)->dac_dma.half_transcom_handle                      = NULL;
        ((hal_dac_dev_struct *)p_struct)->dac_dma.error_handle                              = NULL;
        ((hal_dac_dev_struct *)p_struct)->error_state                                       = DAC_ERROR_NONE;
        ((hal_dac_dev_struct *)p_struct)->state                                             = DAC_STATE_NONE;
        ((hal_dac_dev_struct *)p_struct)->mutex                                             = HAL_MUTEX_UNLOCKED;
        ((hal_dac_dev_struct *)p_struct)->priv                                              = NULL;
        break;
    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      start DAC module function
    \param[in]  dac_dev: DAC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dac_start(hal_dac_dev_struct *dac_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == dac_dev) {
        HAL_DEBUGE("pointer [dac_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    dac_dev->state = DAC_STATE_BUSY;
    hals_dac_enable();

    if(SET == (DAC_CTL & (DAC_CTL_DTEN | DAC_CTL_DTSEL))) {
        hals_dac_software_trigger_enable();
    }
    dac_dev->state = DAC_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      stop DAC module function
    \param[in]  dac_dev: DAC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dac_stop(hal_dac_dev_struct *dac_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == dac_dev) {
        HAL_DEBUGE("pointer [dac_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    hals_dac_disable();

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      start DAC under error interrupt
    \param[in]  dac_dev: DAC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: DAC under error interrupt callback function structure
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dac_start_interrupt(hal_dac_dev_struct *dac_dev, hal_dac_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == dac_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [dac_dev] or pointer [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* lock DAC */
    HAL_LOCK(dac_dev);
    dac_dev->state = DAC_STATE_BUSY;
    dac_dev->dac_irq.dac_underflow_handle = p_irq->dac_underflow_handle;
    /* clear the specified DAC interrupt flag */
    hals_dac_interrupt_flag_clear();
    /*  enable DAC interrupt(DAC DMA underrun interrupt) */
    hals_dac_interrupt_enable();
    /* enable DAC */
    hals_dac_enable();
    /* unlock DAC */
    HAL_UNLOCK(dac_dev);
    /* change DAC state */
    dac_dev->state = DAC_STATE_READY;
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      stop DAC under error interrupt
    \param[in]  dac_dev: DAC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dac_stop_interrupt(hal_dac_dev_struct *dac_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == dac_dev) {
        HAL_DEBUGE("pointer [dac_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* lock DAC */
    HAL_LOCK(dac_dev);
    dac_dev->state = DAC_STATE_BUSY;
    dac_dev->dac_irq.dac_underflow_handle = NULL;
    /* clear the specified DAC interrupt flag */
    hals_dac_interrupt_flag_clear();
    /*  disable DAC interrupt(DAC DMA underrun interrupt) */
    hals_dac_interrupt_disable();
    /* unlock DAC */
    HAL_UNLOCK(dac_dev);
    /* change DAC state */
    dac_dev->state = DAC_STATE_READY;
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      start DAC DMA request
    \param[in]  dac_dev: DAC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  pdata: the source memory buffer address
    \param[in]  length: the number of data to be transferred from source to destination
    \param[in]  aligned_mode:
                only one parameter can be selected which is shown as below:
      \arg          DAC_R12_ALIGNED_MODE: 12-bit right-aligned
      \arg          DAC_L12_ALIGNED_MODE: 12-bit left-aligned
      \arg          DAC_R8_ALIGNED_MODE: 8-bit right-aligned
    \param[in]  dmacb: DAC DMA transfer complete interrupt callback function structure
                  full_transcom_handle: DAC DMA full transfer complete interrupt handler
                  half_transcom_handle: DAC DMA half transfer complete interrupt handler
                  underflow_handle: DAC DMA underflow interrupt handler
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dac_start_dma(hal_dac_dev_struct *dac_dev, uint32_t *pdata, uint32_t length, uint32_t aligned_mode, hal_dac_dma_handle_cb_struct *dmacb)
{
    volatile uint32_t *dac_value_adress;

