PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_dac.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == dac_dev) || (NULL == pdata) || (NULL == dmacb)) {
        HAL_DEBUGE("pointer [dac_dev] or pointer [pdata] or pointer [dmacb] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* lock DAC */
    HAL_LOCK(dac_dev);
    dac_dev->state = DAC_STATE_BUSY;

    dac_dev->dac_dma.full_transcom_handle = dmacb->full_transcom_handle;
    dac_dev->dac_dma.half_transcom_handle = dmacb->half_transcom_handle;
    dac_dev->dac_dma.error_handle = dmacb->error_handle;

    dac_dev->p_dma_dac->dma_irq.full_finish_handle = _dac_dma_full_transfer_complete;
    dac_dev->p_dma_dac->dma_irq.half_finish_handle = _dac_dma_half_transfer_complete;
    dac_dev->p_dma_dac->dma_irq.error_handle = _dac_dma_error;

    switch(aligned_mode) {
    /* data right 12b alignment */
    case DAC_R12_ALIGNED_MODE:
        dac_value_adress = &DAC_R12DH;
        break;
    /* data left 12b alignment */
    case DAC_L12_ALIGNED_MODE:
        dac_value_adress = &DAC_L12DH;
        break;
    /* data right 8b alignment */
    case DAC_R8_ALIGNED_MODE:
        dac_value_adress = &DAC_R8DH;
        break;
    default:
        break;
    }
    /* enable the selected DAC channel DMA request */
    hals_dac_dma_enable();
    /* start the DMA channel */
    hal_dma_start_interrupt(dac_dev->p_dma_dac, (uint32_t)pdata, (uint32_t)dac_value_adress, length, NULL);
    hals_dac_enable();
    dac_dev->state = DAC_STATE_READY;
    /* unlock DAC */
    HAL_UNLOCK(dac_dev);

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      stop DAC DMA request
    \param[in]  dac_dev: DAC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dac_stop_dma(hal_dac_dev_struct *dac_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == dac_dev) {
        HAL_DEBUGE("pointer [dac_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* disable DAC DMA mode */
    hals_dac_dma_disable();
    /* disable the DMA channel */
    hal_dma_stop(dac_dev->p_dma_dac);
    /* disable DAC */
    hals_dac_disable();
#if defined(DAC_CTL_DDUDRIE)
    /* clear interrupt flag */
    hals_dac_interrupt_flag_clear();
    /* disable interrupt */
    hals_dac_interrupt_disable();
#endif /* DAC_CR_DMAUDRIE2 */
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      DAC interrupt handler content function,which is merely used in dac_handler
    \param[in]  dac_dev: DAC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_dac_irq(hal_dac_dev_struct *dac_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == dac_dev) {
        HAL_DEBUGE("pointer [dac_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* check dac underflow interrupt control bit */
    /* check dac underflow interrupt state bit */
    if(SET == hals_dac_interrupt_flag_get()) {
        /* change DAC state to error state */
        dac_dev->state = DAC_STATE_ERROR;
        /* set DAC error state to DMA underflow error */
        dac_dev->error_state = DAC_ERROR_DMA_UNDERFLOW;
        /* clear interrupt flag */
        hals_dac_interrupt_flag_clear();

        /* error callback */
        if(NULL != (dac_dev->dac_irq.dac_underflow_handle)) {
            dac_dev->dac_irq.dac_underflow_handle(dac_dev);
        }
    }
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      set user-defined interrupt callback function
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  dac_dev: DAC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to DAC interrupt callback functions structure
                  hal_irq_handle_cb: the function is user-defined,
    \param[out] none
    \retval     none
*/
int32_t hal_dac_irq_handle_set(hal_dac_dev_struct *dac_dev, hal_dac_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == dac_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [dac_dev] or pointer [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* DAC underflow interrupt handler set */
    if(NULL != p_irq->dac_underflow_handle) {
        dac_dev->dac_irq.dac_underflow_handle = p_irq->dac_underflow_handle;
        hals_dac_interrupt_enable();
    } else {
        dac_dev->dac_irq.dac_underflow_handle = NULL;
        hals_dac_interrupt_disable();
    }
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  dac_dev: DAC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
int32_t hal_dac_irq_handle_all_reset(hal_dac_dev_struct *dac_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == dac_dev) {
        HAL_DEBUGE("pointer [dac_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* DAC underflow interrupt handler set */
    dac_dev->dac_irq.dac_underflow_handle = NULL;
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      configure DAC wave mode
    \param[in]  wave_mode
                only one parameter can be selected which is shown as below:
      \arg        DAC_WAVE_DISABLE: wave disable
      \arg        DAC_WAVE_MODE_LFSR: LFSR noise mode
      \arg        DAC_WAVE_MODE_TRIANGLE: triangle noise mode
    \param[out] none
    \retval     none
*/
void hals_dac_wave_mode_config(uint32_t wave_mode)
{
    DAC_CTL &= ~DAC_CTL_DWM;
    DAC_CTL |= wave_mode;
}

/*!
    \brief      configure DAC wave bit width
    \param[in]  bit_width
                only one parameter can be selected which is shown as below:
      \arg        DAC_WAVE_BIT_WIDTH_1: bit width of the wave signal is 1
      \arg        DAC_WAVE_BIT_WIDTH_2: bit width of the wave signal is 2
      \arg        DAC_WAVE_BIT_WIDTH_3: bit width of the wave signal is 3
      \arg        DAC_WAVE_BIT_WIDTH_4: bit width of the wave signal is 4
      \arg        DAC_WAVE_BIT_WIDTH_5: bit width of the wave signal is 5
      \arg        DAC_WAVE_BIT_WIDTH_6: bit width of the wave signal is 6
      \arg        DAC_WAVE_BIT_WIDTH_7: bit width of the wave signal is 7
      \arg        DAC_WAVE_BIT_WIDTH_8: bit width of the wave signal is 8
      \arg        DAC_WAVE_BIT_WIDTH_9: bit width of the wave signal is 9
      \arg        DAC_WAVE_BIT_WIDTH_10: bit width of the wave signal is 10
      \arg        DAC_WAVE_BIT_WIDTH_11: bit width of the wave signal is 11
      \arg        DAC_WAVE_BIT_WIDTH_12: bit width of the wave signal is 12
    \param[out] none
    \retval     none
*/
void hals_dac_wave_bit_width_config(uint32_t bit_width)
{
    DAC_CTL &= ~DAC_CTL_DWBW;
    DAC_CTL |= bit_width;
}

/*!
    \brief      enable or disable DAC trigger
    \param[in]  trigger_enable: enable DAC trigger
                only one parameter can be selected which is shown as below:
      \arg        ENABLE: trigger enable
      \arg        DISABLE: trigger disable
    \param[out] none
    \retval     none
*/
void hals_dac_trigger_config(uint32_t trigger_enable)
{
    if(trigger_enable == ENABLE) {
        DAC_CTL |= DAC_CTL_DTEN;
    } else {
        DAC_CTL &= ~DAC_CTL_DTEN;
    }
}

/*!
    \brief      enable or disable DAC output buffer
    \param[in]  output_buffer: enable DAC output buffer
                only one parameter can be selected which is shown as below:
      \arg        ENABLE: output buffer enable
      \arg        DISABLE: output buffer disable
    \param[out] none
    \retval     none
*/
void hals_dac_output_buffer_config(uint32_t output_buffer)
{
    if(output_buffer == ENABLE) {
        DAC_CTL &= ~DAC_CTL_DBOFF;
    } else {
        DAC_CTL |= DAC_CTL_DBOFF;
    }
}

/*!
    \brief      configure DAC trigger source
    \param[in]  triggersource: external triggers of DAC
                only one parameter can be selected which is shown as below:
      \arg        DAC_TRIGGER_T1_TRGO: trigger source is TIMER1 TRGO
      \arg        DAC_TRIGGER_T2_TRGO: trigger source is TIMER2 TRGO
      \arg        DAC_TRIGGER_T5_TRGO: trigger source is TIMER5 TRGO
      \arg        DAC_TRIGGER_T14_TRGO: trigger source is TIMER14 TRGO
      \arg        DAC_TRIGGER_EXTI_9: trigger source is EXTI interrupt line9 event
      \arg        DAC_TRIGGER_SOFTWARE: software trigger
    \param[out] none
    \retval     none
*/
void hals_dac_trigger_source_config(uint32_t triggersource)
{
    DAC_CTL &= ~DAC_CTL_DTSEL;
    DAC_CTL |= triggersource;
}

/*!
    \brief      enable DAC software trigger
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_dac_software_trigger_enable(void)
{
    DAC_SWT |= DAC_SWT_SWTR;
}

/*!
    \brief      disable DAC software trigger
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_dac_software_trigger_disable(void)
{
    DAC_SWT &= ~DAC_SWT_SWTR;
}

/*!
    \brief      set DAC data holding register value
    \param[in]  dac_align
                only one parameter can be selected which is shown as below:
      \arg        DAC_R12_ALIGNED_MODE: data right 12b alignment
      \arg        DAC_L12_ALIGNED_MODE: data left 12b alignment
      \arg        DAC_R8_ALIGNED_MODE: data right 8b alignment
    \param[in]  data: data to be loaded
    \param[out] none
    \retval     none
*/
void hals_dac_output_value_set(uint32_t dac_align, uint16_t data)
{
    switch(dac_align) {
    /* data right 12b alignment */
    case DAC_R12_ALIGNED_MODE:
        DAC_R12DH = data;
        break;
    /* data left 12b alignment */
    case DAC_L12_ALIGNED_MODE:
        DAC_L12DH = data << 4;
        break;
    /* data right 8b alignment */
    case DAC_R8_ALIGNED_MODE:
        DAC_R8DH = data;
        break;
    default:
        break;
    }
}

/*!
    \brief      enable DAC
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_dac_enable(void)
{
    DAC_CTL |= DAC_CTL_DEN;
}

/*!
    \brief      disable DAC
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_dac_disable(void)
{
    DAC_CTL &= ~DAC_CTL_DEN;
}

/*!
    \brief      enable DAC DMA
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_dac_dma_enable(void)
{
    DAC_CTL |= DAC_CTL_DDMAEN;
}

/*!
    \brief      disable DAC DMA
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_dac_dma_disable(void)
{
    DAC_CTL &= ~DAC_CTL_DDMAEN;
}

/*!
    \brief      enable DAC interrupt(DAC DMA underrun interrupt)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_dac_interrupt_enable(void)
{
    DAC_CTL |= DAC_CTL_DDUDRIE;
}

/*!
    \brief      disable DAC interrupt(DAC DMA underrun interrupt)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_dac_interrupt_disable(void)
{
    DAC_CTL &= ~DAC_CTL_DDUDRIE;
}

/*!
    \brief      get the specified DAC interrupt flag(DAC DMA underrun interrupt flag)
    \param[in]  none
    \param[out] none
    \retval     the state of DAC interrupt flag(SET or RESET)
*/
FlagStatus hals_dac_interrupt_flag_get(void)
{
    FlagStatus temp_flag = RESET;
    uint32_t ddudr_flag = 0U, ddudrie_flag = 0U;
    /* check the DMA underrun flag and DAC DMA underrun interrupt enable flag */
    ddudr_flag = DAC_STAT & DAC_STAT_DDUDR;
    ddudrie_flag = DAC_CTL & DAC_CTL_DDUDRIE;
    if((RESET != ddudr_flag) && (RESET != ddudrie_flag)) {
        temp_flag = SET;
    }
    return temp_flag;
}

/*!
    \brief      clear the specified DAC interrupt flag(DAC DMA underrun interrupt flag)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void hals_dac_interrupt_flag_clear(void)
{
    DAC_STAT |= DAC_STAT_DDUDR;
}

/*!
    \brief      DAC DMA full transmission complete callback
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _dac_dma_full_transfer_complete(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_dac_dev_struct *dac_dev;
    p_dma = (hal_dma_dev_struct *)dma;
    dac_dev = (hal_dac_dev_struct *)(p_dma->p_periph);

    if(NULL != (dac_dev->dac_dma.full_transcom_handle)) {
        dac_dev->dac_dma.full_transcom_handle(dac_dev);
    }
    dac_dev->state = DAC_STATE_READY;
}

/*!
    \brief      DAC DMA full transmission complete callback
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _dac_dma_half_transfer_complete(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_dac_dev_struct *dac_dev;
    p_dma = (hal_dma_dev_struct *)dma;
    dac_dev = (hal_dac_dev_struct *)(p_dma->p_periph);

    if(NULL != (dac_dev->dac_dma.half_transcom_handle)) {
        dac_dev->dac_dma.half_transcom_handle(dac_dev);
    }
    dac_dev->state = DAC_STATE_READY;
}

/*!
    \brief      DAC DMA underflow error callback
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _dac_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_dac_dev_struct *dac_dev;
    p_dma = (hal_dma_dev_struct *)dma;
    dac_dev = (hal_dac_dev_struct *)(p_dma->p_periph);

    if(NULL != (dac_dev->dac_dma.error_handle)) {
        dac_dev->dac_dma.error_handle(dac_dev);
    }
    dac_dev->state = DAC_STATE_READY;
}
#endif /* GD32F350 */
